%----------------------------------
%QCLDPCBaseH.m---------------------
%
%IEEE802.16e标准LDPC码的构造
%根据该标准的基检验矩阵得到QC-LDPC码的校验矩阵
%
%-----------------------------------
%输入参数说明：
%Nbit：编码码长
%Rate：码率
%----------------------------------
function [qcH,Hb]=QCLDPCBaseH(Nbit,Rate)
%nb,mb为基校验矩阵的列数和行数
%在该标准中，不同码率对于的基校验矩阵，nb值都为24，而mb的值不相同
%z为扩展因子，z=Nbit/nb
%mb=nb-nb*Rate, kb=nb*Rate=nb-mb
%%%%%%%%%%%%%%%
% clear 
% clc
% Nbit=2304;
% Rate=0.5;
%%%%%%%%%%%%%%%%
nb=24;
z=Nbit/nb;
mb=nb-nb*Rate;
%kb=nb-mb;
%Hz=zeros(z);
Hb=[
-1	94	73	-1	-1	-1	-1	-1	55	83	-1	-1	7	0	-1	-1	-1	-1	-1	-1	-1	-1	-1	-1;
-1	27	-1	-1	-1	22	79	9	-1	-1	-1	12	-1	0	0	-1	-1	-1	-1	-1	-1	-1	-1	-1;
-1	-1	-1	24	22	81	-1	33	-1	-1	-1	0	-1	-1	0	0	-1	-1	-1	-1	-1	-1	-1	-1;
61	-1  47	-1	-1	-1	-1	-1	65	25	-1	-1	-1	-1	-1	0	0	-1	-1	-1	-1	-1	-1	-1;
-1	-1	39	-1	-1	-1	84	-1	-1	41	72	-1	-1	-1	-1	-1	0	0	-1	-1	-1	-1	-1	-1;
-1	-1	-1	-1	46	40	-1	82	-1	-1	-1	79	0	-1	-1	-1	-1	0	0	-1	-1	-1	-1	-1;
-1	-1	95	53	-1	-1	-1	-1	-1	14	18	-1	-1	-1	-1	-1	-1	-1	0	0	-1	-1	-1	-1;
-1	11	73	-1	-1	-1	2	-1	-1	47	-1	-1	-1	-1	-1	-1	-1	-1	-1	0	0	-1	-1	-1;
12	-1	-1	-1	83	24	-1	43	-1	-1	-1	51	-1	-1	-1	-1	-1	-1	-1	-1	0	0	-1	-1;
-1	-1	-1	-1	-1	94	-1	59	-1	-1	70	72	-1	-1	-1	-1	-1	-1	-1	-1	-1	0	0	-1;
-1	-1	7	65	-1	-1	-1	-1	39	49	-1	-1	-1	-1	-1	-1	-1	-1	-1	-1	-1	-1	0	0;
43	-1	-1	-1	-1	66	-1	41	-1	-1	-1	26	7	-1	-1	-1	-1	-1	-1	-1	-1	-1	-1	0];

HbNew=zeros(size(Hb));

for i=1:mb
    for j=1:nb
        if Hb(i,j)<0
            Hz=zeros(z);
        elseif Hb(i,j)==0
            Hz=eye(z);
        else
            %码率为1/2，2/3(B类)，3/4(A、B类)，5/6
            HbNew(i,j)=floor(Hb(i,j)*z/96);
            %Hz=circshift(eye(z),[0,Hb(i,j)]);
            Hz=circshift(eye(z),[0,HbNew(i,j)]);
        end
        if j==1
            SubH=Hz;
        else
            SubH=horzcat(SubH,Hz);
        end
    end
    if i==1
        qcH=SubH;
    else
        qcH=vertcat(qcH,SubH);
    end
end
% a=sum(qcH(:,1:1152)')
% b=sum(qcH(:,1:1152))
% check=qcH'*qcH;
% GirthFourNum=GirthFourH(qcH,1152,2304)
        
        
